; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	spectrograph5 - mode
	thermograph7 - mode
	spectrograph8 - mode
	infrared3 - mode
	spectrograph2 - mode
	thermograph0 - mode
	thermograph4 - mode
	infrared1 - mode
	spectrograph6 - mode
	GroundStation1 - direction
	GroundStation3 - direction
	Star4 - direction
	GroundStation0 - direction
	Star2 - direction
	Star5 - direction
	Star6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Star9 - direction
	Phenomenon10 - direction
)
(:init
	(supports instrument0 infrared3)
	(supports instrument0 thermograph0)
	(supports instrument0 spectrograph5)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 infrared3)
	(supports instrument1 spectrograph6)
	(supports instrument1 infrared1)
	(supports instrument1 thermograph4)
	(supports instrument1 spectrograph2)
	(supports instrument1 spectrograph8)
	(supports instrument1 thermograph7)
	(calibration_target instrument1 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star4)
)
(:goal (and
	(pointing satellite0 GroundStation3)
	(have_image Star5 infrared1)
	(have_image Star5 spectrograph2)
	(have_image Star5 thermograph4)
	(have_image Star6 spectrograph5)
	(have_image Star6 spectrograph2)
	(have_image Phenomenon7 spectrograph5)
	(have_image Planet8 spectrograph8)
	(have_image Planet8 spectrograph6)
	(have_image Planet8 spectrograph2)
	(have_image Star9 spectrograph8)
	(have_image Star9 thermograph0)
	(have_image Phenomenon10 infrared3)
	(have_image Phenomenon10 spectrograph8)
	(have_image Phenomenon10 thermograph7)
))

)

; plan
1. (turn_to satellite0 star2 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star2)
   goals met: 0 of 15
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 15
3. (calibrate satellite0 instrument1 star2)
   added: (calibrated instrument1)
   goals met: 0 of 15
4. (turn_to satellite0 star5 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star5)
   goals met: 0 of 15
5. (take_image satellite0 star5 instrument1 thermograph4)
   added: (have_image star5 thermograph4)
   goals met: 1 of 15
6. (take_image satellite0 star5 instrument1 spectrograph2)
   added: (have_image star5 spectrograph2)
   goals met: 2 of 15
7. (take_image satellite0 star5 instrument1 infrared1)
   added: (have_image star5 infrared1)
   goals met: 3 of 15
8. (turn_to satellite0 planet8 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 planet8)
   goals met: 3 of 15
9. (take_image satellite0 planet8 instrument1 spectrograph8)
   added: (have_image planet8 spectrograph8)
   goals met: 4 of 15
10. (take_image satellite0 planet8 instrument1 spectrograph6)
   added: (have_image planet8 spectrograph6)
   goals met: 5 of 15
11. (take_image satellite0 planet8 instrument1 spectrograph2)
   added: (have_image planet8 spectrograph2)
   goals met: 6 of 15
12. (turn_to satellite0 phenomenon10 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 phenomenon10)
   goals met: 6 of 15
13. (take_image satellite0 phenomenon10 instrument1 spectrograph8)
   added: (have_image phenomenon10 spectrograph8)
   goals met: 7 of 15
14. (take_image satellite0 phenomenon10 instrument1 infrared3)
   added: (have_image phenomenon10 infrared3)
   goals met: 8 of 15
15. (take_image satellite0 phenomenon10 instrument1 thermograph7)
   added: (have_image phenomenon10 thermograph7)
   goals met: 9 of 15
16. (turn_to satellite0 star6 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 star6)
   goals met: 9 of 15
17. (take_image satellite0 star6 instrument1 spectrograph2)
   added: (have_image star6 spectrograph2)
   goals met: 10 of 15
18. (turn_to satellite0 star9 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star9)
   goals met: 10 of 15
19. (take_image satellite0 star9 instrument1 spectrograph8)
   added: (have_image star9 spectrograph8)
   goals met: 11 of 15
20. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 11 of 15
21. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 11 of 15
22. (turn_to satellite0 groundstation0 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 groundstation0)
   goals met: 11 of 15
23. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 11 of 15
24. (turn_to satellite0 phenomenon7 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 phenomenon7)
   goals met: 11 of 15
25. (take_image satellite0 phenomenon7 instrument0 spectrograph5)
   added: (have_image phenomenon7 spectrograph5)
   goals met: 12 of 15
26. (turn_to satellite0 star6 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 star6)
   goals met: 12 of 15
27. (take_image satellite0 star6 instrument0 spectrograph5)
   added: (have_image star6 spectrograph5)
   goals met: 13 of 15
28. (turn_to satellite0 star9 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star9)
   goals met: 13 of 15
29. (take_image satellite0 star9 instrument0 thermograph0)
   added: (have_image star9 thermograph0)
   goals met: 14 of 15
30. (turn_to satellite0 groundstation3 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 groundstation3)
   goals met: 15 of 15
